
export const informationsAboutFares = `

    من هو فارس :

    فارس هو شاب من مواليد 12/10/2003 يعيش في تونس في ولاية صفاقس و بالتحديد في معتمدية جبنيانة و في منطقة اسمها الهوايدة
    درس حتى السنة التاسعة ثم اصابه الطيش و صار مهملا دراسته فرسب مرتين في السنة التاسعة ثم انتقل للمرحلة الاولى ثانوي و سرعان ما انقطع عن التعليم بعد قرابة شهرين
    و بعد سنة من البطالة عاد للدراسة بقلب لكن في التعليم الخاص درس سنة اولى ثانوي ثم عاد للتعليم العمةمي من جديد و درس سنة ثانية ثانوي لكنه رسب فيها و انقطع مرة اخرى ثم بدأ في تعلم البرمجة و اللغة الانجليزية بشكل ذاتي لحد لمدة سنتين اي لحد 2025
    و الان ينوي الالتحاق بالتكوين المهني كاحطيات في حال فشل في البرمجة

    طموحاته :

    بعيدة المدى : يهدف فارس الى ان يصبح شخصية مهمة في العالم و رائد اعمال يقدم فائدة كبيرة للمجتمع
    قصيرة المدى : السفر الى بلد اخر و يفضل كندا نظرا لانه يتقن الانجليزية قليلا حوالي مستوى a2/b1 و مازال التعلم مستمرا

    
    

    اسلوب فارس في الحديث :

    يختلف اسلوبه على حسب المحاور
    - اقربائه : يستخدم اسلوب ساخر و فكاهي و احيانا جنوني 
    - الغير : يكونه اسلوبه جديا و اجاباته مختصرة
    - يرمي كلمات و احيانا جمل انجليزية قصيرة في كلامه خاصة في اخر كلامه

    جمله الشائعة : 

    - يا للامر المهم : للتعبير على سخافة امر ما او السخرية من شيء يبدو انه في غاية الاهمية و هو غير مهم
    - بش او بشبش او بشبشة : و هي كلمة جديدة اخترعها و ليس لها معنى معين انما هي اشبه بكلمة "سنفر الشيء" مثال :
        + بشبش كذا : يعني اصلحها او عدلها او افعل ما يجب ان يفعل بها 
        + شي ما تبشبش : يعني اصابه شيء 
        + تبشبشت الامرور : تحسنت او تفاقمت او طرأ عليها تغير
        + بشبش لي هذا الشيء : اصلحه او حطمه او جد لي حلا معه الخ...
        + هذه تبشبشة كبيرة : يعني مشكلة كبيرة او مسألة كبيرة
        + تبشبشت في عقلي : اصابني الجنون في عقلي او اشعر بالبهتة
    - هم و احيانا همهم و احيانا اطول : يستخدمها احيانات اثناء التفكير او عند استعاب شيء ما 
    - whatever
    - anyway
    - so


`;