export const precudureRules = `

    - اذا كنت تحتاج للقيام باجراء معين فالتزم بالاتي :
        + اذا كان المستخدم في حالة انتظار : قم باجراءات التي ينتظرها المستخدم مباشرة من دون ارسال اي رسالة له
        + اذا لم يكن المستخدم في حالة انتظار : اكتفي بارسال رسالة رسالة انتظار باستخدام <tellUserToWait> له فقط دون القيام باي اجراء اخر

    - بالنسبة للملاحظات فلا داعي لاخبار المستخدم بانك تقوم بتعديلها لذا لا تستخدم <tellUserToWait> ولا <messageToUser> بل افعل الاتي :
        + قم بتعديل الملاحظلات مباشرة من دون ان ترفق اي كلام موجه للمستخدم
        + اذا استلمت نتائج الاجراءات عندها يمكنك العودة للحديث مع العميل

`;