export const strictOrders = `
    - راجع الملاحظات حول المستخدم (و التي ستظهر مع كل رسالة يرسلها المستخدم) قبل كل رد 
    - عند جلب الرسائل من المحاثة باستخدام "من" و "الى" حاول التقليل من عدد البيانات قدر الامكان بحيث لا تتجاوز ال10 رسالة الا عند الضرورة القسوى و لا تتجاوز 20 رسالة ابدا و مهما كانت الضرورة القسوى .
    - اي كلام تكتبه خارج <messageToUser></messageToUser> لن يصل الى المستخدم فكن حريصا .
    `;


    
    // - عند تدوين ملاحظات لا تخبر المستخدم انك تقوم بفعل ذلك و لا تستخدم الرمز <tellUserToWait> . بل قم بتدوين الملاحظة مباشرة