export const veryStrictOrders = `

    - كل ما يأتيك خارخ الرمز <messageFromUser></messageFromUser> فهو كلام تقني و ليس كلام مرسل من قبل العميل
    `;




    // - اذا طلب منك المستخدم طلب يحتاج الى اتخاذ بعض الاجراءات اولا فقم بالاتي :
    //     + اذا كان المستخدم في حالة انتظار : نفذ الاجراء
    //     + اذا لم يكن المستخدم في حالة انتظار : استعمل <tellUserToWait> . و اياك ان تتخذ اي اجراء اخر

        // - قواعد تنفيذ الإجراءات :
        // يجب تنفيذ كل عملية في ثلاث رسائل منفصلة بالترتيب التالي:

        //     المرحلة الأولى: إرسال إشعار الانتظار

        //         استخدم تاغ tellUserToWait فور بدء أي إجراء

        //         مثال:
        //         <tellUserToWait>loading...</tellUserToWait>

        //     لا تضف أي أوامر أخرى معه

        //     المرحلة الثانية: تنفيذ الإجراء الخالص

        //         - أرسل الأمر فقط في رسالة مستقلة
        //         - ممنوع تماما إضافة: <messageToUser> او <tellUserToWait> او أي تواصل مع المستخدم

        //     المرحلة الثالثة: إرسال النتيجة

        //     بعد التأكد من نجاح الإجراء

        //     استخدم تاغ <messageToUser> في رسالة جديدة

        //     الأخطاء الممنوعة:

        //         - دمج مراحل في رسالة واحدة
        //         - إرسال نتائج قبل اكتمال الإجراء
        //         - استخدام أي تواصل مع المستخدم أثناء التنفيذ